Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You can also use this function to create the camera and then use the different camera_set_* functions to set up the view, however note that you must provide at least a position and view size, otherwise the resulting camera will not be valid and give odd results if applied to a view port (if you do not set the object following, borders or move speed these will be set to the default values for a view camera in the Room Editor).
zh_cn: 您也可以使用此函数创建相机，然后使用不同的camera_set_*函数来设置视图，但是注意，您必须至少提供一个位置和视图大小，否则生成的相机将无效，并且如果应用于视口，会产生奇怪的结果(如果您没有设置对象跟随、边界或移动速度，这些将在房间编辑器中设置为视图相机的默认值)。

source: You can also use this function to design a system where the user can define their own keys for playing by simply mapping the user input key to the key that you have coded into the game.
zh_cn: 您还可以使用此函数设计一个系统，在该系统中，用户可以通过简单地将用户输入键映射到您已编码到游戏中的键来定义自己的游戏键。

source: You can assign each virtual key you define to a variable too, which can then be used in the further virtual key functions to show, hide and delete them.
zh_cn: 您也可以将您定义的每个虚拟键分配给一个变量，该变量可用于进一步的虚拟键功能，以显示、隐藏和删除它们。

source: You can assign script functions to a layer with layer_script_begin() and layer_script_end().
zh_cn: 您可以使用layer_script_begin()和layer_script_end()将脚本函数分配给图层。

source: You can call the function with a value of -1 to switch off the overlay.
zh_cn: 您可以调函数用值-1的来关闭覆盖。

source: You can change it to give the instance a different sprite by giving it the name of a sprite from the resource tree or by using a variable that has an externally loaded sprite indexed in it.
zh_cn: 你可以通过给它一个来自资源树的精灵的名字或者使用一个外部加载的精灵索引的变量来改变它，给实例一个不同的精灵。

source: You can change the base time zone to use with the function date_set_timezone()
zh_cn: 您可以通过函数date_set_timezone()来更改基本时区

source: You can change the base time zone to use with the function date_set_timezone().
zh_cn: 您可以使用date_set_timezone()函数来更改基本时区。

source: You can change this value to skip parts of the time line, or to repeat parts or to start the time line again from the beginning.
zh_cn: 您可以更改此值以跳过时间线的部分内容，或重复部分内容，或从开始重新开始时间线。

source: You can change this variable to change the height of the room at any time, and changes will be applied to the bottom of the room, as the origin is considered to be the top left corner.
zh_cn: 您可以随时更改此变量来更改房间的高度，更改将应用于房间的底部，因为原点被认为是左上角。

source: You can change this variable to change the width of the room at any time.
zh_cn: 你可以在任何时候改变这个变量来改变房间的宽度。

source: You can change this variable to switch looping on or off and it works with a negative time line speed (if the time line position goes below 0 it will start again at the last defined moment).
zh_cn: 您可以更改这个变量来切换循环的开启或关闭，并且它以负的时间线速度工作(如果时间线位置低于0，它将在最后定义的时刻重新开始)。

source: You can check font indices as defined from the Asset Browser, or fonts that have been added using functions like font_add().
zh_cn: 要检查的字体索引。

source: You can check the return value of this function too as a debug tool to check whether the surface target was set or not, with a return value of 0 being a failure to set the target and any other positive value being a success.
zh_cn: 您也可以检查此函数的返回值，作为一个调试工具来检查是否设置了表面目标，返回值0表示设置目标失败，任何其他正值表示设置成功。

source: You can check this function to see if it was successful or not (it will return true on success or false otherwise), as it may fail if there already exists the same key in the DS map or you specify a non-existent DS map as the ID of the map to add to.
zh_cn: 您可以检查此函数，看看它是否成功(如果成功，它将返回true，否则返回false)，因为如果DS map中已经存在相同的键，或者您指定一个不存在的DS map作为要添加到的map的ID，它可能会失败。

source: You can check to see if a variable holds an int64 using the function is_int64().
zh_cn: 可以使用is_int64()函数检查变量是否包含int64。

source: You can create a bit-mask by using the audio_get_listener_info() and then using the bitwise or ("|") to create a custom mask with those listeners that you require the sound to play from, and then apply this custom mask to the emitter.
zh_cn: 您可以使用audio_get_listener_info()创建一个位掩码，然后使用按位or("|")创建一个自定义掩码，其中包含您需要播放声音的那些侦听器，然后将此自定义掩码应用到发射器。

source: You can create a bit-mask by using the audio_get_listener_info() and then using the bitwise or ("|") to create a custom mask with those listeners that you require the sound to play from, and then apply this custom mask to the sound after you have played it.
zh_cn: 您可以使用audio_get_listener_info()创建一个位掩码，然后使用按位or ("| ")创建一个自定义掩码，用于您需要播放声音的那些侦听器，然后在您播放声音后将该自定义掩码应用于声音。

source: You can create and maintain multiple grid structures at the same moment if you need them for different things, but be aware that each grid will require memeory, and the more cells they have the more memory they will require. Also note that the MP functions are quite processor heavy to use so the more often you call them and the higher the cell resolution then the more likely you are to have a drop in performance.
zh_cn: 如果你需要它们做不同的事情，你可以同时创建和维护多个网格结构，但是要注意每个网格都需要内存，并且它们拥有的单元越多，它们需要的内存就越多。还要注意的是，MP函数使用起来相当耗费处理器资源，因此调用次数越多，单元分辨率越高，性能下降的可能性就越大。

source: You can create such a matrix using the matrix_build() or matrix_get() functions or simply building the array yourself and passing that into the function.
zh_cn: 可以使用matrix_build()或matrix_get()函数创建这样的矩阵，也可以自己构建数组并将其传递到函数中。

source: You can define "space" as being any character you want, for example a single line the size that you want the space to be, and all spaces in text will be rendered at that width (but the image chosen will never be rendered), or if you don't supply a sprite for space then the width of the widest character in the sprite font will be used instead.
zh_cn: 您可以将"空格"定义为您想要的任何字符，例如您想要的空格大小的单行，文本中的所有空格都将以该宽度呈现(但所选的图像永远不会呈现)，或者如果您没有为空格提供sprite，则将使用sprite字体中最宽字符的宽度。

source: You can define how precise the drawing is with the function draw_set_circle_precision().
zh_cn: 可以使用draw_set_circle_precision()函数定义绘图的精确度。

source: You can define how precise the drawing of the corners is with the function draw_set_circle_precision(), but this function uses a fixed radius for them (should you need to change the corner radius, use the function draw_roundrect_ext()).
zh_cn: 您可以使用draw_set_circle_precision()函数来定义绘制角的精确度，但是此函数使用固定的半径(如果需要更改角的半径，可以使用draw_roundrect_ext()函数)。

source: You can define how precise the drawing of the corners is with the function draw_set_circle_precision().
zh_cn: 可以使用draw_set_circle_precision()函数定义绘制角的精确度。

source: You can define the size of the font (in points), as well as whether the font should be bold or italic, and you can also define the range of characters to include.
zh_cn: 您可以定义字体的大小(以点为单位)，以及字体应该是粗体还是斜体，还可以定义要包含的字符范围。

source: You can define the text that is to appear in the dialogue, as well as the text you wish to appear on the two buttons and the URL where the comment has to be posted.
zh_cn: 您可以定义将出现在对话框中的文本，以及您希望出现在两个按钮上的文本，以及必须发布评论的URL。

source: You can end shader use with function shader_reset().
zh_cn: 你可以使用shader_reset()函数来结束着色器的使用。

source: You can even give x a real value like 12.345, but as you cannot get .345 of a pixel, the instance may not appear to have moved, although these values will be maintained and used internally by GameMaker and are perfectly valid.
zh_cn: 你甚至可以给x一个实数值，比如12.345，但是由于你不能得到一个像素的0.345，这个实例可能看起来没有移动，尽管这些值将被GameMaker内部维护和使用，并且完全有效。

source: You can even give y a real value like 12.345, but as you cannot get .345 of a pixel, the instance may not appear to have moved, although these values will be maintained and used internally by GameMaker and are perfectly valid.
zh_cn: 你甚至可以给y一个实数值，比如12.345，但是由于你不能得到一个像素的0.345，实例可能看起来没有移动，尽管这些值将由GameMaker内部维护和使用，并且完全有效。

source: You can even specify a parent object and all children instances with that parent will also receive the fixture.
zh_cn: 您甚至可以指定一个父对象，并且具有该父对象的所有子实例也将接收该夹具。

source: You can find a complete list of the available constants this function requires from the the page for the function event_perform().
zh_cn: 您可以从函数event_perform()的页面中找到此函数所需的可用常量的完整列表。

source: You can find a list of Android system flags here.
zh_cn: 你可以在这里找到Android系统标志的列表。

source: You can find out how many recorder sources are available using the function audio_get_recorder_count(), and the map returned will contain the following key/value pairs:
zh_cn: 你可以使用函数audio_get_recorder_count()找出有多少录音机源可用，返回的映射将包含以下键/值对:

source: You can find out more about creating projection matrices from the section Matrix Functions, specifically matrix_build_projection_perspective() and matrix_build_projection_ortho().
zh_cn: 有关创建投影矩阵的更多信息，请参阅矩阵函数一节，特别是Matrix _ build _ projection _ perspective()和matrix_build_projection_ortho()。

source: You can find out more about creating view matrices from the section Matrix Functions, specifically matrix_build_lookat().
zh_cn: 您可以从矩阵函数一节了解更多关于创建视图矩阵的信息，特别是matrix_build_lookat()。

source: You can find out more about the format of the sequence instance struct on this page.
zh_cn: 您可以在这个页面上找到更多关于序列实例结构的格式的信息。

source: You can find out more about the format of the sequence object struct on this page.
zh_cn: 您可以在本页找到有关序列对象结构格式的更多信息。

source: You can find the number of parameters for the current game using the function parameter_count(), where the first parameter has index 1 and the last one has the index returned by the function (a value of 0 is special on that it is the filename of the game executable, including the path).
zh_cn: 您可以使用parameter_count()函数找到当前游戏的参数数量，其中第一个参数的索引为1，最后一个参数的索引由此函数返回(值0是特殊的，因为它是游戏可执行文件的文件名，包括路径)。

source: You can find the number of parameters for the current game using this function, where the first parameter has index 1 and the last one has the index returned by the function (a value of 0 is special on that it is the filename of the game executable, including the path).
zh_cn: 您可以使用此函数找到当前游戏的参数数量，其中第一个参数的索引为1，最后一个参数的索引由此函数返回(值0是特殊的，因为它是游戏可执行文件的文件名，包括路径)。

source: You can get more information about the returned texture page using the different texture_ functions found here.
zh_cn: 你可以使用这里找到的不同的texture_函数获得更多关于返回的纹理页面的信息。

source: You can get or set these message events, and when getting this property an array of keyframe structs is returned, and for setting the property you should supply an array of keyframe structs.
zh_cn: 您可以获取或设置这些消息事件，当获取此属性时，将返回一个关键帧结构数组，为了设置该属性，您应该提供一个关键帧结构数组。

source: You can get or set these moment events, and when getting this property an array of keyframe structs is returned, and for setting the property you should supply an array of keyframe structs.
zh_cn: 您可以获取或设置这些moment事件，当获取此属性时，将返回一个关键帧结构数组，为了设置该属性，您应该提供一个关键帧结构数组。

source: You can get or set this property, and when getting this property an array of track structs is returned, and for setting the property you should supply an array of track structs.
zh_cn: 您可以获取或设置此属性，当获取此属性时，将返回一个跟踪结构数组，为了设置该属性，您应该提供一个跟踪结构数组。

source: You can get or set this value and it will modify the global audio output for all tracks - for example, if you have an audio track with a volume of 0.8 and then set the sequence volume property to 0.5, the audio track will have a final volume of 0.4.
zh_cn: 您可以获取或设置该值，它将修改所有轨道的全局音频输出-例如，如果您有一个音量为0.8的音频轨道，然后将序列音量属性设置为0.5，则该音频轨道的最终音量将为0.4。

source: You can get or set this value, but note that making a sequence shorter may cause issues if a sequence instance referencing this sequence has its playhead set to past the new length.
zh_cn: 您可以获取或设定此值，但注意，如果引用此序列的序列实例将其播放头设定为超过新长度，则缩短序列可能会导致问题。

source: You can get or set this value.
zh_cn: 您可以获取或设置该值。

source: You can get the ID for the notification to cancel using the functions push_get_first_local_notification() and push_get_next_local_notification() and the function will return true on success or false otherwise (for example if the notification does not exist or has already been triggered).
zh_cn: 您可以使用函数push_get_first_local_notification()和push_get_next_local_notification()获取要取消的通知的ID，如果成功，此函数将返回true，否则返回false(例如，如果通知不存在或已经被触发)。

source: You can get the available environment variables on macOS and Ubuntu (Linux) by typing "env" into the terminal app, and for information on Windows environment variables, if you are using the command prompt then type "echo %PATH%", and using PowerShell it's "ls env".
zh_cn: 在macOS和Ubuntu (Linux)上，您可以通过在终端应用程序中键入"env"来获取可用的环境变量，有关Windows环境变量的信息，如果您使用的是命令提示符，则键入"echo %PATH%"，使用PowerShell则是"ls env"。

source: You can get the number of recorder sources using the function audio_get_recorder_count(), and once you start recording the audio will be stored in a temporary buffer and start triggering an Audio Recording Asynchronous Event.
zh_cn: 您可以使用函数audio_get_recorder_count()获得录音机源的数量，一旦您开始记录，音频将被存储在一个临时缓冲区中，并开始触发音频记录异步事件。

source: You can get the playerid using the achievement_load_friends() or the achievement_load_leaderboard() functions and you must also supply the challengeid which is the unique value given the challenge when you created it on your iTunes Connect or Google Play dashboard.
zh_cn: 您可以使用成就_加载_好友()或成就_加载_排行榜()函数获取playerid，还必须提供挑战id，这是您在iTunes Connect或Google Play dashboard上创建挑战时给出的唯一值。

source: You can give it an object_index to check for, in which case this function will return true if any active instances of the specified object exist in the current room, or you can also supply it with an instance id, in which case this function will return true if that specific instance exists and is active in the current room.
zh_cn: 您可以给它一个object_index来进行检查，在这种情况下，如果指定对象的任何活动实例存在于当前房间中，此函数将返回true;或者您也可以为它提供一个实例id，在这种情况下，如果特定实例存在并且在当前房间中活动，此函数将返回true。

source: You can have an object with no mask while an instance of that same object can have one and vice-versa, or they can even have different masks.
zh_cn: 您可以有一个没有掩码的对象，而该对象的实例可以有掩码，反之亦然，或者它们甚至可以有不同的掩码。

source: You can have an object with no sprite while an instance of that same object can have one and vice-versa, or they can even have different sprites.
zh_cn: 你可以让一个对象没有精灵，而该对象的实例可以有精灵，反之亦然，或者它们甚至可以有不同的精灵。

source: You can have as many arguments as you require (note that more arguments will mean that the function will be slower to parse).
zh_cn: 您可以有您需要的任意数量的参数(注意，更多的参数将意味着函数解析的速度会更慢)。

source: You can have up to 8 view ports active in a room (array values 0 through 7), and can assign a camera to any of them by simply setting this variable to the camera ID value (as returned by the functions camera_create() or camera_create_view()).
zh_cn: 在一个房间中最多可以有8个活动的视图端口(数组值从0到7)，并且可以通过简单地将该变量设置为相机ID值(由camera_create()或camera_create_view()函数返回)来将相机分配给其中的任何一个。

source: You can read the returned string from this function back into a ds_grid using the function ds_grid_read().
zh_cn: 您可以使用函数ds_grid_read()将此函数返回的字符串读回ds_grid。

source: You can replace a sprite from the game assets using this function, but doing so means that you will lose the reference ID for the sprite that you are replacing, regardless of whether you call game_restart() or not, and so is not recommended.
zh_cn: 您可以使用此函数替换游戏资源中的精灵，但是这样做意味着您将丢失正在替换的精灵的引用ID，无论您是否调用game_restart()都是如此，因此不建议这样做。

source: You can retrieve tile data using the function tilemap_get() and then use the tile_ functions to change it before setting the cell using this function.
zh_cn: 可以使用函数tilemap_get()检索平铺数据，然后在使用此函数设置单元格之前使用tile_函数更改它。

source: You can retrieve tile data using the function tilemap_get_at_pixel() and then use the tile_ functions to change it before setting it again using this function.
zh_cn: 您可以使用函数tilemap_get_at_pixel()检索平铺数据，然后使用tile_函数在使用此函数再次设置之前更改它。

source: You can select the sprite and then tell GameMaker to use the sprite and animate it or not, and if you choose animated, then you can also choose to have the sub-images changed at an interval such that the animation will begin and end at the beginning and end of the lifetime of each particle created (so that if you have a lifetime set to a 15 step minimum and a 30 step maximum, no matter what value the lifetime has the animation will be made to fit, with it running faster for the shorter lifetimes and slower for the longer).
zh_cn: 您可以选择精灵，然后告诉GameMaker使用精灵并设置动画或不设置动画，如果您选择动画，那么您还可以选择以一定的间隔更改子图像，以便动画将在创建的每个粒子的生命周期的开始和结束时开始和结束(这样，如果您将生命周期设置为最小15步，最大30步，无论生命周期的值是多少，动画都将被调整，生命周期越短运行越快，生命周期越长运行越慢)。

source: You can set a negative value for the step number and a particle will be emitted at a random interval based on that, so that, for example, a value of -3 will have a 1:3 chance of emitting a particle each step.
zh_cn: 你可以为步数设置一个负值，然后粒子将在此基础上以随机间隔发射，例如，值为-3的每一步发射粒子的几率为1:3。

source: You can set a timeout value for connection, or alternatively make the creation asynchronous, using the function network_set_config(), or alternatively use the function network_connect_async() instead.
zh_cn: 您可以为连接设置超时值，或者使用函数network_set_config()使创建异步，或者使用函数network_connect_async()代替。

source: You can set a timeout value for connection, or alternatively make the creation asynchronous, using the function network_set_config(), or alternatively use the function network_connect_async_raw() instead.
zh_cn: 您可以设置连接的超时值，或者使用函数network_set_config()使创建异步，或者使用函数network_connect_async_raw()代替。

source: You can set an individual instances mask index using the mask_index instance variable.
zh_cn: 可以使用mask_index实例变量设置单个实例掩码索引。

source: You can set an individual instances persistent flag using the persistent instance variable.
zh_cn: 可以使用持久化实例变量设置单个实例持久化标志。

source: You can set an individual instances solid flag using the solid instance variable.
zh_cn: 可以使用solid实例变量设置单个实例的固体标志。

source: You can set an individual instances sprite using the sprite_index instance variable.
zh_cn: 您可以使用sprite_index实例变量设置一个单独的实例精灵。

source: You can set an individual instances visibility using the visible instance variable.
zh_cn: 可以使用可见实例变量设置单个实例的可见性。

source: You can set it to an empty string "" to effectively clear the clipboard of text.
zh_cn: 您可以将其设置为空字符串 ""，以有效地清除剪贴板中的文本。

source: You can set the "perf" argument to true which will force GameMaker to perform the Destroy and Clean Up events of the found instance as well as the Create event of the new instance, or false to not perform any of these events.
zh_cn: 您可以将"perf"参数设置为true，这将强制GameMaker执行找到的实例的销毁和清理事件以及新实例的创建事件，或者设置为false，不执行任何这些事件。

source: You can set the AA level using the function draw_set_swf_aa_level().
zh_cn: 您可以使用函数 draw_set_swf_aa_level() 设置 AA 级别。

source: You can set the number of particles being streamed to zero and call this function again to "switch off" the particle streaming, and the function will also accept negative numbers for the amount, in which case the emitter will produce particles based on random chance.
zh_cn: 您可以将粒子流的数量设置为零，并再次调用此函数来"关闭"粒子流，此函数也将接受负数的数量，在这种情况下，发射器将基于随机机会产生粒子。

source: You can set the time value to values higher than the total duration of the animation and the animation will loop back to the beginning, but you run the risk of losing floating point accuracy as the accumulated time gets larger.
zh_cn: 您可以将时间值设置为高于动画的总持续时间的值，这样动画就会循环回到开始，但是随着累积时间的增加，您将面临失去浮点精度的风险。

source: You can set this in one of two ways - as either game frames per second (FPS) or as microseconds per game frame (MPF) - using one of the following two constants:
zh_cn: 您可以使用以下两个常量之一以两种方式进行设置，即每秒游戏帧数(FPS)或每游戏帧微秒数(MPF):

source: You can set this to -1 to remove a mask sprite and so default to the mask defined for the sprite of the object (or no masks if no sprite has been chosen).
zh_cn: 你可以将其设置为-1以删除一个遮罩精灵，并默认使用为对象的精灵定义的遮罩(如果没有选择精灵则不使用遮罩)。

source: You can set this to a particular time line to use that one, or set it to -1 to stop using a time line for the instance (if no time line is defined for the instance, -1 is returned too).
zh_cn: 您可以将其设置为特定的时间线以使用该时间线，或者将其设置为-1以停止对实例使用时间线(如果没有为实例定义时间线，则也返回-1)。

source: You can specify a local x and y position to copy from as well as the width and height of the section.
zh_cn: 您可以指定要复制的局部x和y位置以及截面的宽度和高度。

source: You can specify a margin outside the edges of the room for this to occur, and when the instance has travelled outside of that margin GameMaker will automatically wrap it back into the room at the other side.
zh_cn: 您可以在房间边缘之外指定一个边界来实现这一点，当实例移动到边界之外时，GameMaker会自动将其从房间的另一边返回。

source: You can specify an initial starting size for the buffer (in bytes) and it will return a "handle" (index) for the buffer which should then be used in all further calls to the buffer.
zh_cn: 您可以指定缓冲区的初始起始大小(以字节为单位)，它将为缓冲区返回一个"句柄"(索引)，然后在所有对缓冲区的后续调用中使用该句柄。

source: You can specify an object index for the target and all instances present in the room at the time will receive that fixtures properties (but not any new instances of the object created later), or you can use the special keywords other and all.
zh_cn: 您可以为目标指定一个对象索引，此时房间中的所有实例都将接收到该夹具属性(但不是后来创建的对象的任何新实例)，或者您可以使用特殊关键字other和all。

source: You can specify in the function whether to consider precise collisions or not and the forbidden cells marked will change depending on this setting.
zh_cn: 您可以在函数中指定是否考虑精确碰撞，标记的禁用单元格将根据此设置而变化。

source: You can specify the range of vertex data that you wish to copy into the buffer, where the start vertex can be anywhere between 0 and the number of vertices -1, and you can give the number of vertices from that point on to copy.
zh_cn: 您可以指定要复制到缓冲区中的顶点数据的范围，其中起始顶点可以是0到顶点数-1之间的任何值，并且您可以给出从该点开始要复制的顶点数。

source: You can supply a value of -1 for the size argument and the entire buffer will be loaded.
zh_cn: 您可以为size参数提供-1的值，这样就会加载整个缓冲区。

source: You can switch animation sets easily using the skeleton_animation_set() function, but this may cause a skip or stutter as one animation is swapped for another.
zh_cn: 您可以使用skeleton_animation_set()函数轻松切换动画集，但这可能会导致在一个动画与另一个动画交换时出现跳跃或停顿。

source: You can then re-load the ds_map using the function ds_map_secure_load().
zh_cn: 然后可以使用ds_map_secure_load()函数重新加载ds_map。

source: You can use -1 or 0 for the maxdist being a default 1000px, ie: GameMaker will move the instance continually up 1000 pixels until it is out of collision.
zh_cn: 你可以使用-1或0作为默认的1000像素的最大距离，例如:GameMaker会将实例连续向上移动1000像素，直到它脱离碰撞。

source: You can use hex notation ($AARRGGBB) a real number or use any of the make_colour_*() functions to define the colour value.
zh_cn: 您可以使用十六进制表示法($AARRGGBB)表示一个实数，或者使用任何make_colour_*()函数来定义颜色值。

source: You can use negative values to signify that the instance should follow the path in reverse.
zh_cn: 您可以使用负值来表示实例应该沿相反的路径前进。

source: You can use real numbers (like 0.5, or 2.4 for example) and if the value is larger than one, several moments can happen within the same time step (they will all be performed in the same order as defined for the time line, so no actions will be skipped).
zh_cn: 您可以使用实数(例如0.5或2.4)，如果值大于1，则可以在同一时间步内发生多个时刻(它们将按照时间线定义的相同顺序执行，因此不会跳过任何动作)。

source: You can use the function tilemap_get() to get the tile data which can then be manipulated using the Tile Functions, or you can construct it yourself using the following tile constants along with the index value of the tile to create:
zh_cn: 您可以使用函数 tilemap_get() 来获取可以使用图块(Tile)函数操作的图块数据，或者您可以使用以下图块常量以及要创建的图块的索引值自己构建它：

source: You can use the function vertex_get_number() on the vertex buffer to get the total number of vertices stored.
zh_cn: 您可以在顶点缓冲区上使用vertex_get_number()函数来获取存储的顶点总数。

source: You can use this code to remove a path from memory.
zh_cn: 您可以使用此代码从内存中移除一个路径。

source: You can use this function to change one instance of an object into another instance of a different object, and while doing so decide whether to perform the initial instances Destroy and Clean Up Events and the new instances Create Event.
zh_cn: 您可以使用此函数将对象的一个实例更改为不同对象的另一个实例，并在此过程中决定是否执行初始实例销毁事件和清理事件以及新实例创建事件。

source: You can use this function to check and see if a background element exists on any given layer.
zh_cn: 您可以使用此函数来检查和查看任何给定图层上是否存在背景元素。

source: You can use this function to check and see if a sprite element exists on any given layer.
zh_cn: 你可以使用此函数来检查精灵元素是否存在于任何给定的图层上。

source: You can use this function to check and see if a tile map element exists on any given layer.
zh_cn: 您可以使用此函数来检查并查看在任何给定的层上是否存在一个tile map元素。
